Foundation42/microkernel/platforms/esp32/main/main.c
#define TCP_TEST_PORT 19900

static bool test_tcp_loopback(void) {
    ESP_LOGI(TAG, "=== Test 3: TCP loopback ===");

    /* Listen on all interfaces */
    ESP_LOGI(TAG, "TCP listen on port %d", TCP_TEST_PORT);
    transport_t *server = transport_tcp_listen("0.0.0.0", TCP_TEST_PORT, 2);
    if (!server) {
        ESP_LOGE(TAG, "transport_tcp_listen failed");
        return false;
    }

    /* Connect to ourselves */
    ESP_LOGI(TAG, "TCP connect to 127.0.0.1:%d", TCP_TEST_PORT);
    transport_t *client = transport_tcp_connect("127.0.0.1", TCP_TEST_PORT, 1);
    if (!client) {
        ESP_LOGE(TAG, "transport_tcp_connect failed");
        server->destroy(server);
        return false;
    }

    /* Send a message from client to server */
    const char *payload = "hello";
    message_t *msg = message_create(
        0x200000001ULL,  /* source: node 2, actor 1 */
        0x100000001ULL,  /* dest:   node 1, actor 1 */
        42, (const uint8_t *)payload, strlen(payload));
    if (!msg) {
        ESP_LOGE(TAG, "message_create failed");
        client->destroy(client);
        server->destroy(server);
        return false;
    }

    bool sent = client->send(client, msg);
    message_destroy(msg);
    if (!sent) {
        ESP_LOGE(TAG, "transport send failed");
        client->destroy(client);
        server->destroy(server);
        return false;
    }
    ESP_LOGI(TAG, "Sent message via TCP transport");

    /* Give lwIP loopback a moment */
    vTaskDelay(pdMS_TO_TICKS(50));

    /* Server receives (triggers accept + recv) */
    message_t *recv_msg = server->recv(server);
    if (!recv_msg) {
        ESP_LOGE(TAG, "transport recv returned NULL");
        client->destroy(client);
        server->destroy(server);
        return false;
    }

    bool ok = (recv_msg->type == 42 &&
               recv_msg->payload_size == strlen(payload) &&
               memcmp(recv_msg->payload, payload, strlen(payload)) == 0);

    if (ok) {
        ESP_LOGI(TAG, "Received message via TCP transport, payload OK");
    } else {
        ESP_LOGE(TAG, "Received message but payload mismatch!");
    }
    message_destroy(recv_msg);

    client->destroy(client);
    server->destroy(server);

    ESP_LOGI(TAG, "TCP loopback test %s!", ok ? "passed" : "FAILED");
    return ok;
}

/* ── Test 4: HTTP GET ──────────────────────────────────────────────── */

typedef struct {
    int status_code;
    char body[1024];
    size_t body_size;
    bool got_response;
    bool got_error;
} http_test_state_t;

static bool http_get_behavior(runtime_t *rt, actor_t *self,
                               message_t *msg, void *state) {
    (void)self;
    http_test_state_t *s = state;

    if (msg->type == MSG_BOOTSTRAP) {
        char url[128];
        snprintf(url, sizeof(url), "http://%s:8080/hello", TEST_SERVER_IP);
        ESP_LOGI(TAG, "HTTP GET %s", url);
        actor_http_get(rt, url);
        return true;
    }

    if (msg->type == MSG_HTTP_RESPONSE) {
        const http_response_payload_t *p = msg->payload;
        s->status_code = p->status_code;
        s->body_size = p->body_size < sizeof(s->body) - 1 ?
                       p->body_size : sizeof(s->body) - 1;
        memcpy(s->body, http_response_body(p), s->body_size);
        s->body[s->body_size] = '\0';
        s->got_response = true;
        return false;
    }

    if (msg->type == MSG_HTTP_ERROR) {
        const http_error_payload_t *p = msg->payload;
        ESP_LOGE(TAG, "HTTP GET error: %s", p->message);
        s->got_error = true;
        return false;
    }

    return true;
}

static bool test_http_get(void) {
    ESP_LOGI(TAG, "=== Test 4: HTTP GET ===");

    runtime_t *rt = runtime_init(1, 16);
    if (!rt) return false;

    http_test_state_t *s = calloc(1, sizeof(*s));
    actor_id_t id = actor_spawn(rt, http_get_behavior, s, NULL, 16);
    actor_send(rt, id, MSG_BOOTSTRAP, NULL, 0);
    runtime_run(rt);

    bool ok = s->got_response && s->status_code == 200 &&
              strstr(s->body, "hello") != NULL;

    ESP_LOGI(TAG, "HTTP GET test %s (status=%d body=%s)",
             ok ? "passed" : "FAILED", s->status_code, s->body);

    runtime_destroy(rt);
    free(s);
    return ok;
}

/* ── Test 5: HTTP POST ─────────────────────────────────────────────── */

static bool http_post_behavior(runtime_t *rt, actor_t *self,
                                message_t *msg, void *state) {
    (void)self;
    http_test_state_t *s = state;

    if (msg->type == MSG_BOOTSTRAP) {
        char url[128];
        snprintf(url, sizeof(url), "http://%s:8080/echo", TEST_SERVER_IP);
        ESP_LOGI(TAG, "HTTP POST %s", url);
        const char *hdrs[] = {"Content-Type: text/plain"};
        const char *body = "esp32 post test";
        actor_http_fetch(rt, "POST", url, hdrs, 1, body, strlen(body));
        return true;
    }

    if (msg->type == MSG_HTTP_RESPONSE) {
        const http_response_payload_t *p = msg->payload;
        s->status_code = p->status_code;
        s->body_size = p->body_size < sizeof(s->body) - 1 ?
                       p->body_size : sizeof(s->body) - 1;
        memcpy(s->body, http_response_body(p), s->body_size);
        s->body[s->body_size] = '\0';
        s->got_response = true;
        return false;
    }

    if (msg->type == MSG_HTTP_ERROR) {
        const http_error_payload_t *p = msg->payload;
        ESP_LOGE(TAG, "HTTP POST error: %s", p->message);
        s->got_error = true;
        return false;
    }

    return true;
}

static bool test_http_post(void) {
    ESP_LOGI(TAG, "=== Test 5: HTTP POST ===");

    runtime_t *rt = runtime_init(1, 16);
    if (!rt) return false;

    http_test_state_t *s = calloc(1, sizeof(*s));
    actor_id_t id = actor_spawn(rt, http_post_behavior, s, NULL, 16);
    actor_send(rt, id, MSG_BOOTSTRAP, NULL, 0);
    runtime_run(rt);

    bool ok = s->got_response && s->status_code == 200 &&
              strstr(s->body, "esp32 post test") != NULL;

    ESP_LOGI(TAG, "HTTP POST test %s (status=%d body=%s)",
             ok ? "passed" : "FAILED", s->status_code, s->body);

