Foundation42/microkernel/platforms/esp32/main/main.c
    runtime_t *rt = runtime_init(MN_NODE_A, 8);
    if (!rt) {
        tp->destroy(tp);
        return false;
    }

    runtime_add_transport(rt, tp);

    mn_state_t *state = calloc(1, sizeof(*state));
    state->peer = actor_id_make(MN_NODE_B, 1);
    state->target = MN_ROUNDS;
    actor_spawn(rt, mn_node_a_behavior, state, NULL, 16);

    ESP_LOGI(TAG, "Cross-device server: waiting for ping from peer...");
    runtime_run(rt);

    bool ok = (state->count >= MN_ROUNDS);
    ESP_LOGI(TAG, "Cross-device server: done (count=%d)", state->count);

    runtime_destroy(rt);
    free(state);
    return ok;
}

static bool run_cross_client(peer_info_t *peer) {
    /* Give server time to set up listen socket */
    vTaskDelay(pdMS_TO_TICKS(200));

    struct in_addr addr = { .s_addr = peer->ip };
    char *peer_ip = inet_ntoa(addr);
    ESP_LOGI(TAG, "Cross-device: connecting to %s:%d", peer_ip, CROSS_TCP_PORT);

    transport_t *tp = transport_tcp_connect(peer_ip, CROSS_TCP_PORT, MN_NODE_A);
    if (!tp) {
        ESP_LOGE(TAG, "Cross-device: transport_tcp_connect failed");
        return false;
    }

    runtime_t *rt = runtime_init(MN_NODE_B, 8);
    if (!rt) {
        tp->destroy(tp);
        return false;
    }

    runtime_add_transport(rt, tp);

    mn_state_t *state = calloc(1, sizeof(*state));
    state->peer = actor_id_make(MN_NODE_A, 1);
    state->target = MN_ROUNDS;
    actor_id_t id = actor_spawn(rt, mn_node_b_behavior, state, NULL, 16);

    /* Bootstrap triggers initial MSG_PING */
    actor_send(rt, id, MSG_BOOTSTRAP, NULL, 0);

    ESP_LOGI(TAG, "Cross-device client: sending first ping...");
    runtime_run(rt);

    bool ok = (state->count >= MN_ROUNDS);
    ESP_LOGI(TAG, "Cross-device client: done (count=%d)", state->count);

    runtime_destroy(rt);
    free(state);
    return ok;
}

static bool test_cross_device(void) {
    ESP_LOGI(TAG, "=== Test 10: Cross-device distributed actors ===");

    uint8_t my_mac[6];
    esp_wifi_get_mac(WIFI_IF_STA, my_mac);

    esp_netif_ip_info_t ip_info;
    esp_netif_t *netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
    esp_netif_get_ip_info(netif, &ip_info);

    ESP_LOGI(TAG, "My MAC: %02x:%02x:%02x:%02x:%02x:%02x  IP: " IPSTR,
             my_mac[0], my_mac[1], my_mac[2],
             my_mac[3], my_mac[4], my_mac[5],
             IP2STR(&ip_info.ip));

    peer_info_t peer = {0};
    if (!discover_peer(&peer, my_mac, ip_info.ip.addr)) {
        ESP_LOGW(TAG, "Test 10: no peer discovered, skipping cross-device test");
        return true; /* skip, not fail */
    }

    if (peer.is_server) {
        return run_cross_server(&peer);
    } else {
        return run_cross_client(&peer);
    }
}

/* ── Test 11: HTTP Server GET 200 (self-test via loopback) ─────────── */

#define HTTP_SRV_GET_PORT  19904
#define HTTP_SRV_POST_PORT 19905
#define SSE_SRV_PORT       19906
#define WS_SRV_PORT        19907

typedef struct {
    int status_code;
    bool got_request;
    bool got_response;
    char body[256];
} http_srv_state_t;

static bool http_srv_get_behavior(runtime_t *rt, actor_t *self,
                                   message_t *msg, void *state) {
    (void)self;
    http_srv_state_t *s = state;

    if (msg->type == MSG_BOOTSTRAP) {
        actor_http_listen(rt, HTTP_SRV_GET_PORT);
        actor_http_get(rt, "http://127.0.0.1:19904/hello");
        return true;
    }

    if (msg->type == MSG_HTTP_REQUEST) {
        const http_request_payload_t *p = msg->payload;
        s->got_request = true;
        ESP_LOGI(TAG, "Server got %s %s",
                 http_request_method(p), http_request_path(p));
        actor_http_respond(rt, p->conn_id, 200, NULL, 0,
                           "hello from esp32", 16);
        return true;
    }

    if (msg->type == MSG_HTTP_RESPONSE) {
        const http_response_payload_t *p = msg->payload;
        s->got_response = true;
        s->status_code = p->status_code;
        size_t len = p->body_size < sizeof(s->body) - 1 ?
                     p->body_size : sizeof(s->body) - 1;
        memcpy(s->body, http_response_body(p), len);
        s->body[len] = '\0';
        return false;
    }

    if (msg->type == MSG_HTTP_ERROR) {
        const http_error_payload_t *p = msg->payload;
        ESP_LOGE(TAG, "HTTP srv GET error: %s", p->message);
        return false;
    }

    return true;
}

static bool test_http_server_get(void) {
    ESP_LOGI(TAG, "=== Test 11: HTTP Server GET 200 ===");

    runtime_t *rt = runtime_init(1, 32);
    if (!rt) return false;

    http_srv_state_t *s = calloc(1, sizeof(*s));
    actor_id_t id = actor_spawn(rt, http_srv_get_behavior, s, NULL, 32);
    actor_send(rt, id, MSG_BOOTSTRAP, NULL, 0);
    runtime_run(rt);

    bool ok = s->got_request && s->got_response &&
              s->status_code == 200 &&
              strstr(s->body, "hello from esp32") != NULL;

    ESP_LOGI(TAG, "HTTP Server GET test %s (req=%d resp=%d status=%d body=%s)",
             ok ? "passed" : "FAILED",
             s->got_request, s->got_response, s->status_code, s->body);

    runtime_destroy(rt);
    free(s);
    return ok;
}

/* ── Test 12: HTTP Server POST Echo (self-test via loopback) ──────── */

static bool http_srv_post_behavior(runtime_t *rt, actor_t *self,
                                    message_t *msg, void *state) {
    (void)self;
    http_srv_state_t *s = state;

    if (msg->type == MSG_BOOTSTRAP) {
        actor_http_listen(rt, HTTP_SRV_POST_PORT);
        const char *hdrs[] = {"Content-Type: text/plain"};
        actor_http_fetch(rt, "POST", "http://127.0.0.1:19905/echo",
                         hdrs, 1, "ping", 4);
        return true;
    }

    if (msg->type == MSG_HTTP_REQUEST) {
        const http_request_payload_t *p = msg->payload;
        s->got_request = true;
        const void *body = http_request_body(p);
        ESP_LOGI(TAG, "Server got POST, body_size=%zu", p->body_size);
        actor_http_respond(rt, p->conn_id, 200, NULL, 0,
                           body, p->body_size);
        return true;
    }

