Foundation42/microkernel/platforms/esp32/main/main.c
    bool ok = s->got_reply && s->reply_type == WASM_MSG_RECV_REPLY &&
              s->reply_size == 5 && memcmp(s->reply, "hello", 5) == 0;

    ESP_LOGI(TAG, "WASM fiber recv test %s (reply_type=%u reply=%s)",
             ok ? "passed" : "FAILED",
             (unsigned)s->reply_type, s->reply);

    runtime_destroy(rt);
    free(s);
    return ok;
}

/* ── WASM test runner (must run in a pthread for WAMR compatibility) ── */

static void *wasm_test_runner(void *arg) {
    bool *pass = (bool *)arg;

    if (!wasm_actors_init()) {
        ESP_LOGE(TAG, "wasm_actors_init failed!");
        *pass = false;
        return NULL;
    }

    if (!test_wasm_spawn()) *pass = false;
    if (!test_wasm_echo()) *pass = false;
    if (!test_wasm_fiber_sleep()) *pass = false;
    if (!test_wasm_fiber_recv()) *pass = false;

    wasm_actors_cleanup();
    return NULL;
}

/* ── Entry point ───────────────────────────────────────────────────── */

void app_main(void) {
    esp_vfs_eventfd_config_t eventfd_config = {
        .max_fds = 8,
    };
    ESP_ERROR_CHECK(esp_vfs_eventfd_register(&eventfd_config));

    bool pass = true;

    if (!test_pingpong()) pass = false;
    if (!test_timer()) pass = false;

    /* WASM tests (no network needed).
       Run in a pthread because WAMR's ESP-IDF platform layer calls
       pthread_self() internally, which asserts if the calling task
       wasn't created via pthread_create(). */
    {
        bool wasm_pass = true;
        esp_pthread_cfg_t pcfg = esp_pthread_get_default_config();
        pcfg.stack_size = 16384;
        esp_pthread_set_cfg(&pcfg);

        pthread_t wasm_thread;
        pthread_create(&wasm_thread, NULL, wasm_test_runner, &wasm_pass);
        pthread_join(wasm_thread, NULL);
        if (!wasm_pass) pass = false;
    }

#if SOC_WIFI_SUPPORTED
    /* Network tests require WiFi (for lwIP network stack) */
    bool wifi_ok = wifi_init();
    if (wifi_ok) {
        if (!test_tcp_loopback()) pass = false;
        if (!test_http_get()) pass = false;
        if (!test_http_post()) pass = false;
        if (!test_ws_echo()) pass = false;
        if (!test_https_get()) pass = false;
        if (!test_wss_echo()) pass = false;
        if (!test_multinode()) pass = false;
        if (!test_cross_device()) pass = false;

        /* Server self-tests via loopback (no external dependencies) */
        if (!test_http_server_get()) pass = false;
        if (!test_http_server_post()) pass = false;
        if (!test_sse_server()) pass = false;
        if (!test_ws_server()) pass = false;
    } else {
        ESP_LOGW(TAG, "Skipping network tests (no WiFi)");
    }

    if (pass && wifi_ok) {
        ESP_LOGI(TAG, "All 18 smoke tests passed!");
    } else if (pass) {
        ESP_LOGI(TAG, "Core + WASM tests passed (network tests skipped — no WiFi)");
    } else {
        ESP_LOGE(TAG, "Some smoke tests FAILED!");
    }
#else
    if (pass) {
        ESP_LOGI(TAG, "All 6 smoke tests passed (no WiFi on this chip)!");
    } else {
        ESP_LOGE(TAG, "Some smoke tests FAILED!");
    }
#endif
}
